[
  {
    "id": "119f4a5f-ccdc-5d96-ba45-dbef1bc45ecf",
    "slug": "14045-nw-161a-ave",
    "acf": {
      "slug": "4-bedroom-7-bathroom-14045-nw-161a-ave",
      "title": "4 bedroom 7 bathroom 14045 NW 161a Ave",
      "description": "<p>Welcome to a custom built 1710 sqft bi-level with 960 sqft of finished basement living space. Located in a keyhole crescent in the community of Carlton. Steps to schools, just a minute to all amenities and Anthony Henday. Large open foyer leads you up to 9 ft. cathedral ceilings in the kitchen, dining, and living room areas afford an open and spacious area for family and entertaining while the many south facing windows allow for lots of natural light. 20&#215;20 italian porcelain tile, engineered oak hardwood. Stunning white kitchen cabinetry w/granite counters, soft close feature, under-mount lighting, with extensive drawers. Walkin pantry. All high end SS appliances. Duradek patio with aluminum railings. Large living room with modern gas remote start fireplace. En-suite has a long granite counter with double sinks, a beautiful tiled glass 5 ft shower, and oval soaker tub. The basement offers a rumpus room, 2 additional bedrooms, a bathroom and flex workout/hot tub area. A/C, heated large garage. MUST SEE! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1710",
      "numbedroom": "4",
      "numbathroom": "7",
      "mlsnumber": "E4194359",
      "address": "14045 NW 161a Ave",
      "city": "Edmonton",
      "listedprice": "549900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194359/20200418193649/01.jpeg"
    }
  },
  {
    "id": "86833be7-57ca-572e-b21a-6e7861528087",
    "slug": "30-979-nw-crystallina-nera-wy",
    "acf": {
      "slug": "3-bedroom-3-bathroom-30-979-nw-crystallina-nera-wy",
      "title": "3 bedroom 3 bathroom 30-979 NW Crystallina Nera Wy",
      "description": "<p>Welcome to your brand new PEAK 39 Townhome! Presenting the Alpine in the Crystallina Nera community. This beautiful unit features 2 bedrooms and a master complete with an ensuite bathroom; a spacious open concept main floor with 9&#8242; ceilings; 2 flex spaces, perfect for an office or den; a double car garage with ample storage space. The kitchen features modern finishes including quartz countertops and soft-close cabinetry. You will find luxury vinyl plank flooring, ceramic tile, and carpet throughout the home. The Laundry room is conveniently placed on the same level as the bedrooms. You can enjoy the outdoors and beautiful surrounding communities on your oversized balcony. Come check it out and see for yourself! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1669",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4194178",
      "address": "30-979 NW Crystallina Nera Wy",
      "city": "Edmonton",
      "listedprice": "300000",
      "propertytype": "Townhouse",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194178/20200417002057/01.jpeg"
    }
  },
  {
    "id": "e69fe6d9-c328-5f37-bd95-7c1a553a0ec9",
    "slug": "29-979-nw-crystallina-nera-wy",
    "acf": {
      "slug": "2-bedroom-3-bathroom-29-979-nw-crystallina-nera-wy",
      "title": "2 bedroom 3 bathroom 29-979 NW Crystallina Nera Wy",
      "description": "<p>Welcome to your brand new PEAK 39 Townhome! Presenting the Highland in the Crystallina Nera community. This beautiful unit features 2 large Master bedrooms, complete with their own ensuite bathrooms; a spacious open concept main floor with 9&#8242; ceilings; 2 flex spaces, perfect for an office or den; a double car garage with ample storage space. The kitchen features modern finishes including quartz countertops and soft close cabinetry. You will find luxury vinyl plank flooring, ceramic tile, and carpet throughout the home. The Laundry room is conveniently placed on the same level as both bedrooms. You can enjoy the outdoors and beautiful surrounding communities on your oversized balcony. Come check it out and see for yourself! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1668",
      "numbedroom": "2",
      "numbathroom": "3",
      "mlsnumber": "E4194186",
      "address": "29-979 NW Crystallina Nera Wy",
      "city": "Edmonton",
      "listedprice": "305000",
      "propertytype": "Townhouse",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194186/20200417005101/01.jpeg"
    }
  },
  {
    "id": "cc1a7e12-82ac-5523-8b16-90898efc6782",
    "slug": "11211-nw-24-ave",
    "acf": {
      "slug": "5-bedroom-4-bathroom-11211-nw-24-ave",
      "title": "5 bedroom 4 bathroom 11211 NW 24 Ave",
      "description": "<p>Gorgeous 2nd owner home in Blue Quill.. 2983 sq ft (Large)5 bedroom, 4 bathroom + main floor den /(or 6th bedroom) .Custom built home has many extras. Enjoy the outdoors, backyard is beautifully private with large deck, upper deck off master bedroom and many perennials, shrubs and trees. RV Parking. The interior of the home has been remodeled in last few years Extensive hardwood, granite counter-tops, 2 newer furnaces with over size hot-water tank, central air-conditioning (2), newer carpets through-out, newer bathrooms, large eating nook overlooks backyard. Large formal living room and dining room. Family room on main floor has lots of built-ins and fireplace. The garage is oversize and all finished. Main floor laundry room is good size. Don&#8217;t miss out on this gorgeous family home. It is a great property and is priced to sell! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2983",
      "numbedroom": "5",
      "numbathroom": "4",
      "mlsnumber": "E4194286",
      "address": "11211 NW 24 Ave",
      "city": "Edmonton",
      "listedprice": "569980",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194286/20200417213721/01.jpeg"
    }
  },
  {
    "id": "1f4c380d-93b4-5e2c-93e8-d824af7b7b47",
    "slug": "10909-nw-60-ave",
    "acf": {
      "slug": "4-bedroom-4-bathroom-10909-nw-60-ave",
      "title": "4 bedroom 4 bathroom 10909 NW 60 Ave",
      "description": "<p>MODERN DESIGN in beautiful Pleasantview, UNLIKE OTHER INFILLS. This 2050 sqft 2-storey home comes with a rare ATTACHED DRIVE UNDER GARAGE leaving room for a HUGE REAR YARD! Close to plenty of shopping, parks, transit &#038; easy COMMUTING. This 4 bed, 3.1 bath, boasts a SPACIOUS OPEN CONCEPT dining &#038; kitchen area with a FORMAL SEPARATED LIVING space and Foyer. Kitchen features 2-TONED QUARTZ countertops &#038; cabinets, w/ SS appliances, and storage. Through the back-patio doors is a lovely COVERED DECK, open to the large SOUTH FACING YARD. Upstairs are 2 LARGE BEDS with a Jack/Jill bath, one of the rooms has a PATIO overlooking the yard. Master-Suite is a retreat w/ a SPA-LIKE 5-piece ensuite, beautiful wrap-around tile, glass shower &#038; soaker tub. A SEPARATE ENTRANCE to the basement with 9ft ceilings, is fitted for a FUTURE LEGAL SUITE and can easily be converted, that presents INVESTMENT OPPORTUNITY. Near Whitemud &#038; Calgary Trail, easy access to the LRT, UofA, Downtown &#038; River Valley. This home is a MUST SEE!! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2055",
      "numbedroom": "4",
      "numbathroom": "4",
      "mlsnumber": "E4194165",
      "address": "10909 NW 60 Ave",
      "city": "Edmonton",
      "listedprice": "699900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194165/20200416193704/01.jpeg"
    }
  },
  {
    "id": "6cbf8fee-9ccc-5227-8d39-37a101bad3c5",
    "slug": "7621-nw-getty-li",
    "acf": {
      "slug": "3-bedroom-3-bathroom-7621-nw-getty-li",
      "title": "3 bedroom 3 bathroom 7621 NW Getty Li",
      "description": "<p>Perfect affordable family home in the hugely popular community of Granville! BRAND NEW K-9 PUBLIC school, Kim Hung, around the corner. Just a few steps to a gorgeous greenspace featuring a playground along with plenty of natural beauty to take in as you traverse kilometres of walking paths around a lake. Minutes to the Anthony Henday, Costco and all your shopping needs. Everything you need is right here. This 1600 SF 2013 Bedrock built home is perfect for a growing family or professional couple. Features include main floor laundry and 3 great sized bedrooms including a Master suite which boasts a 5-piece ensuite and deep walk-in closet. The open floor plan is perfect to relax and entertain in. Dazzling SOUTH SUN beams natural light into the house all day long. Insulated double attached garage. The basement is unspoiled and ready for your imagination. Nice and wide open with the utilities tucked into a corner. Wouldn&#8217;t you love to be here in time for the summer BBQ season to enjoy your stay-cation here? (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1600",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4194216",
      "address": "7621 NW Getty Li",
      "city": "Edmonton",
      "listedprice": "419000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194216/20200417033709/01.jpeg"
    }
  },
  {
    "id": "8eee385e-b63c-54fc-81d0-551a8bf98c00",
    "slug": "204-530-nw-hooke-rd",
    "acf": {
      "slug": "2-bedroom-2-bathroom-204-530-nw-hooke-rd",
      "title": "2 bedroom 2 bathroom 204-530 NW Hooke Rd",
      "description": "<p>RAVINE VIEW! Amazing value for this 2 bedroom, and 2 bathroom condo! Wonderful open floor plan boasting 1072 square feet. Featuring a gorgeous kitchen with eating island, stainless steel appliances and generous dining area. Large living room with access to your balcony that overlooks the gorgeous river valley views. 2 large bedrooms, 3 piece ensuite plus a 4 piece bathroom, generous closets, in-suite laundry, and a stand up freezer. Built-in shelving for storage too. TWO TITLED PARKING STALLS! One underground and one above ground. Condo fees include heat and water! Lovely complex, professionally managed and offers an exercise room, sauna, social room, and car wash. Excellent location close to many wonderful Edmonton amenities. See it today! Visit REALTOR website for additional information. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1072",
      "numbedroom": "2",
      "numbathroom": "2",
      "mlsnumber": "E4194201",
      "address": "204-530 NW Hooke Rd",
      "city": "Edmonton",
      "listedprice": "239900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194201/20200416233712/01.jpeg"
    }
  },
  {
    "id": "59b88467-d863-5c94-acd5-4295251374bb",
    "slug": "319-16221-nw-95-st",
    "acf": {
      "slug": "2-bedroom-2-bathroom-319-16221-nw-95-st",
      "title": "2 bedroom 2 bathroom 319-16221 NW 95 St",
      "description": "<p>Welcome to the TOP FLOOR of Park Place Eaux Claires! This cozy 2 bed/2bath is perfect and waiting for you with an OPEN CONCEPT design, vaulted ceilings, laminate/ceramic tile flooring and more. Open kitchen/dining boasts SS APPLIANCES, island seating, tile backsplash and loads of cabinetry/counter space + enough room for 6 person table for entertaining. Living room is ideal for your needs with enough space for two couches, enjoys natural sunlight and offers access to balcony that looks over green space! Master bedroom is ready for your inspiration and comes with all the space you could ask for + WALKTHROUGH CLOSET and 4 pc ENSUITE BATH. Second bedroom is spacious + on the opposite side of the unit, making this an ideal potential suite for rental/investment purposes! In-suite laundry and second full bath complete this charming unit. Situated next next to shopping/public transit and and 5 min drive to most major amenities/Henday make this a truly ideal location. See it today and don&#8217;t delay (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "831",
      "numbedroom": "2",
      "numbathroom": "2",
      "mlsnumber": "E4194112",
      "address": "319-16221 NW 95 St",
      "city": "Edmonton",
      "listedprice": "169900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194112/20200415233712/01.jpeg"
    }
  },
  {
    "id": "b64d6600-c77c-55e2-ab57-63aa63446c91",
    "slug": "3507-nw-106-ave",
    "acf": {
      "slug": "4-bedroom-1-bathroom-3507-nw-106-ave",
      "title": "4 bedroom 1 bathroom 3507 NW 106 Ave",
      "description": "<p>Don&#8217;t miss out on this well maintained and recently renovated 1,130 sq.ft. 3 bedroom bilevel style family home in the heart of Rundle Heights. Main floor upgrades over the past few years include a complete main floor transformation including a complete kitchen &#038; bathroom renovation; hardwood &#038; ceramic tile flooring; LED lighting &#038; splatter ceilings; colonial doors &#038; trim and vinyl windows w/ custom blinds. The basement is partially completed with a laminate beam installed in a future family room; roughed-in plumbing; bedroom; upgraded hi-efficiency furnace, central A/C &#038; hot water tank. Exterior amenities and updates include roof shingles, vinyl siding &#038; stone accents; a private backyard with a newer 20&#8217;x12&#8242; deck and 2 fences; 22&#8217;x20&#8242; detached garage&#8230; and the list goes on! Conveniently located within walking distance to Ivor Dent (K-9) School , Rundle Park and transportation needs. Immediate possession available. SIMPLY PUT&#8230;GREAT VALUE! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1131",
      "numbedroom": "4",
      "numbathroom": "1",
      "mlsnumber": "E4194109",
      "address": "3507 NW 106 Ave",
      "city": "Edmonton",
      "listedprice": "329900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194109/20200415233712/01.jpeg"
    }
  },
  {
    "id": "517c6ca0-9d91-5ceb-b5f5-ed03dd6bb04b",
    "slug": "9760-nw-223-st",
    "acf": {
      "slug": "3-bedroom-3-bathroom-9760-nw-223-st",
      "title": "3 bedroom 3 bathroom 9760 NW 223 St",
      "description": "<p>Spectacular brand NEW ENERGY EFFICIENT 2214 sf home U/C by New Era Luxury Homes. Modern architecture built w/the highest standard of workmanship &#038; modern colors. Located in Secord, a popular neighborhood close to all amenities/freeway. Designed for homeowners looking for an open concept plan. 3 beds + 2.5 bath home. Breathtaking vaulted great rm w/feature FP &#038; 9 main floor ceilings. Engineered HW flooring on the main level w/a den &#038; huge, Chef&#8217;s kitchen featuring quartz counters, modern cabinetry, huge island, wall oven &#038; cook top stove (appl allowance) + a walkthru pantry to mud rm. Sleek glass railing leads to the upper lvl incl a spacious laundry rm &#038; large bonus rm w/tray ceilings. Relax in your LARGE private master w/a spa-like ensuite w/stand alone shower, his/hers sinks, soaker + W/I closet. WEST facing yard/ quiet street. Huge garage will fit a large SUV. Close to all amenities, walking distance of school, shops, park/playground &#038; transit. **Colours/Finishing will vary from photos shown (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2215",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4194081",
      "address": "9760 NW 223 St",
      "city": "Edmonton",
      "listedprice": "524800",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194081/20200415193727/01.jpeg"
    }
  },
  {
    "id": "8dbed15b-faba-56f8-9f3c-9253ce264a94",
    "slug": "161-nw-kiniski-cr",
    "acf": {
      "slug": "3-bedroom-2-bathroom-161-nw-kiniski-cr",
      "title": "3 bedroom 2 bathroom 161 NW Kiniski Cr",
      "description": "<p>WALDO IS MOVING! Here is your chance to own his 3 bedroom bilevel that backs onto walking trails in Kiniski Gardens. Waldo has loved this bright and sunny home with a south facing living room that brings in lots of light all year long. The kitchen and dining area are perfect spaces for Waldo to make meals for his friends. He&#8217;s upgraded the appliances, and even installed a dishwasher (his kids were happy they didn&#8217;t have to do it anymore). The two bedrooms and 4 piece bath on the main floor were great when Waldo was raising his family here. Downstairs is just as bright and sunny thanks to the large bilevel windows (Waldo has replaced all the windows too, so you don&#8217;t have to). There&#8217;s a large bedroom, a 3 piece bath and a bright family room. The yard is fenced so Woof the dog doesn&#8217;t get away, but when it&#8217;s time for a walk Waldo just heads out of the back gate onto the walking trails and park space right behind the home. Waldo has done a great job with this house, and now its your turn! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "880",
      "numbedroom": "3",
      "numbathroom": "2",
      "mlsnumber": "E4193871",
      "address": "161 NW Kiniski Cr",
      "city": "Edmonton",
      "listedprice": "280000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193871/20200411233634/01.jpeg"
    }
  },
  {
    "id": "88a0a49c-8f9c-5782-ba8b-b53bb2c026c3",
    "slug": "1131-nw-68-st",
    "acf": {
      "slug": "4-bedroom-3-bathroom-1131-nw-68-st",
      "title": "4 bedroom 3 bathroom 1131 NW 68 St",
      "description": "<p>UPGRADED EVERYTHING(LIKE LITERALLY FROM WINDOWS AND FURNACES TO BATHROOMS, QUARTZ COUNTERS AND KITCHEN!!!) &#8230;.AWESOME PRIVATE YARD&#8230;.This 4 Bedroom Bungalow has it all! Enter into a lovely and bright entrance. Big NEW windows( well they are all NEW!) in Living room offer lots of light to enjoy adjoining the den/flex/dinning room attached to the Gorgeous Modern kitchen with lots of cupboard storage, new backsplash, Stainless steel appliances &#038; quartz countertops. 3 Bedrooms on main floor-all with new paint. Master Bedroom offers double closet and perfect 2 pce ensuite. There are 2 more bedrooms and a 5 pce bath on the main too. The Fully Finished Basement offers separate Entry at the back of the house and features a large Rec Room area, the 4th Bedroom with walk-in Closet, Exercise Room plus 4pc Bathroom. Large landscaped yard is fully fenced with Detached double Car Garage OVERSIZED perfect deck (A Rare find these days!) super east access to the Anthony Henday too, Don&#8217;t miss this !~WELCOME HOME~! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1236",
      "numbedroom": "4",
      "numbathroom": "3",
      "mlsnumber": "E4193870",
      "address": "1131 NW 68 St",
      "city": "Edmonton",
      "listedprice": "374702",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193870/20200411233634/01.jpeg"
    }
  },
  {
    "id": "78bca4f9-0dd6-50d1-8f76-a0c0d2c0754e",
    "slug": "515-12111-nw-51-ave",
    "acf": {
      "slug": "1-bedroom-1-bathroom-515-12111-nw-51-ave",
      "title": "1 bedroom 1 bathroom 515-12111 NW 51 Ave",
      "description": "<p>Welcome to this BRIGHT AND SUNNY, unit located on the TOP FLOOR of Californian Lansdowne. Situated on the top floor youll enjoy the comforts of the QUIET, fully AIR-CONDITIONED suite. Huge kitchen with lots of cupboards, center island prep-island making cooking easy. Open concept is ideal for entertaining with a COZY CORNER FIREPLACE in the adjacent living room with a 14 HIGH CEILING. Spacious bedroom, good-sized closet, and convenient IN-SUITE LAUNDRY with extra storage space. SOUTH FACING balcony with a PARK &#038; TENNIS COURTS to the east. An EXCELLENT FACILITY that includes a GUEST SUITE for your overnight visitors, large SOCIAL ROOM, a GYM, CAR WASH bay &#038; WORKSHOP for the handyman! Complete with UNDERGROUND PARKING &#038; enclosed STORAGE unit. Incredible location just off Whitemud and close to Southgate LRT &#8211; just a few stops from UofA, walking distance to TRANSIT, and shopping centers. Move right in and enjoy the good life!! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "705",
      "numbedroom": "1",
      "numbathroom": "1",
      "mlsnumber": "E4193857",
      "address": "515-12111 NW 51 Ave",
      "city": "Edmonton",
      "listedprice": "189900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193857/20200411193635/01.jpeg"
    }
  },
  {
    "id": "41f9ea1b-36b3-5fa1-9b76-c3ef330dba1e",
    "slug": "9743-nw-223-st",
    "acf": {
      "slug": "3-bedroom-3-bathroom-9743-nw-223-st",
      "title": "3 bedroom 3 bathroom 9743 NW 223 St",
      "description": "<p>Love at 1st sight! Spectacular built green Canada gold certified 2344 sf WALKOUT home backing to a beautiful pond. U/C by New Era Luxury Homes, this gorgeous modern, 3 Bedrm/ 2.5 bath 2 sty built w/quality workmanship. Designed for homeowners looking for an open concept plan. Breathtaking vaulted great rm w/natural light galore, a linear FP &#038; 9 ceilings + 8&#8242; doors on main floor. Engineered HW flooring on the main level w/a den &#038; huge Chef&#8217;s kitchen w/quartz counters, modern cabinetry, LED pot lights, huge island, wall oven &#038; cook top stove (appl allowance) + a convenient walk thru pantry to mud rm. Duradeck w/glass rail. Sleek glass railing leads to the upper lvl incl a laundry rm &#038; large bonus rm w/gorgeous tray ceilings. Chill in your LARGE master suite w/a spa-like ensuite w/stand alone tiled shower, dbl sinks, soaker tub + W/I closet w/organizers. O/S garage. Nestled on a quiet street close to all amenities, fwy, walking distance to school, shops, park/playground &#038; transit. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2344",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4194083",
      "address": "9743 NW 223 St",
      "city": "Edmonton",
      "listedprice": "649999",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194083/20200415193728/01.jpeg"
    }
  },
  {
    "id": "254242d6-6caa-5310-995e-e61ff479f9f5",
    "slug": "8905-sw-8-ave",
    "acf": {
      "slug": "4-bedroom-4-bathroom-8905-sw-8-ave",
      "title": "4 bedroom 4 bathroom 8905 SW 8 Ave",
      "description": "<p>GREAT ELLERSLIE LOCATION CLOSE TO ALL YOUR AMENITIES WALKING DISTANCE TO K-9 SCHOOL .GOOD ACCESS TO ANTHONY HENDAY Q2 HIGHWAY MINUTES FROM INTERNATIONAL AIRPORT.THIS 2016 SQ FT M/L 2 STOREY HOME WITH HUGE M/B/R TOTAL 3 BEDROOMS UP AND BASEMENT FULLY DEVELOPED BEDROOM,BATHROOM 3 PCE,LR,KITCHEN ONLY NEEDS A CONNECTION FOR A STOVE.VERY NICE KITCHEN WITH GRANITE COUNTER TOPS AMPLE CUPBOARD SPACE ,PANTRY, NICE SIZE DINING AREA,FAMILY ROOM WITH FIREPLACE.BASEMENT HAS INFLOOR HEATING .ALSO.HOME HAS JUST BEING REPAINTED NOT ALL BUT A GOOD PERCENTAGE OF THE HOME ALSO NEW CARPET HAS BEEN INSTALLED. DECK ACCESS FROM DINING AREA .ALL THIS ON A HUGE LOT WITH SOME FRUIT TREES.THIS PROPERTY ALSO HAS OUTSIDE SPRINKLER SYSTEM . (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2017",
      "numbedroom": "4",
      "numbathroom": "4",
      "mlsnumber": "E4194084",
      "address": "8905 SW 8 Ave",
      "city": "Edmonton",
      "listedprice": "389900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194084/20200418183107/01.jpeg"
    }
  },
  {
    "id": "7908c27e-ed78-59f3-98f3-b1ebb0b354a5",
    "slug": "206-11325-nw-83-st",
    "acf": {
      "slug": "1-bedroom-2-bathroom-206-11325-nw-83-st",
      "title": "1 bedroom 2 bathroom 206-11325 NW 83 St",
      "description": "<p>Gorgeous 1 bedroom plus den condo has it all. Fresh new paint throughout, including the ceiling! 5 appliances including insuite laundry. Kitchen has plenty of cupboard/countertop space, double corner sink and large island. 2 full bathrooms. Spacious master bedroom includes 4 pc ensuite and large walk-in closet. Beautiful private balcony off the living room. Great location with easy LRT and bussing access. Easy access to downtown, Concordia College, Grant MacEwan, NAIT and the U of A and shopping. Near Commonwealth Station. Unit comes with 1 assigned parking stall, plenty of visitor parking and handicap access. Small pets are permitted. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "819",
      "numbedroom": "1",
      "numbathroom": "2",
      "mlsnumber": "E4194050",
      "address": "206-11325 NW 83 St",
      "city": "Edmonton",
      "listedprice": "149900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4194050/20200415123635/01.jpeg"
    }
  },
  {
    "id": "eb4ff65a-6120-5352-a191-461c65536bb4",
    "slug": "4335-nw-126-ave",
    "acf": {
      "slug": "3-bedroom-3-bathroom-4335-nw-126-ave",
      "title": "3 bedroom 3 bathroom 4335 NW 126 Ave",
      "description": "<p>Beautifully kept 2 storey located in Homesteader features 9 ft. ceilings, gleaming Laminate flooring, with a TRIPLE attached tandem garage. The open concept kitchen offers granite countertops, stainless steel appliances, corner pantry and large island with breakfast bar! The master bedroom comes with a walk-in closet and beautiful 4 piece ensuite with soaker tub and separate shower. Upstairs youll also find a 4 piece main bathroom, laundry room and 2 more spacious bedrooms. Additional features include: an alarm system, blinds, A/C, wood deck, and fully landscaped. This amazing home is located close to walking trails, parks &#038; ponds and offers easy access to Yellowhead Trail. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1734",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4193941",
      "address": "4335 NW 126 Ave",
      "city": "Edmonton",
      "listedprice": "384800",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193941/20200413213655/01.jpeg"
    }
  },
  {
    "id": "a3ecb6cf-0f68-5167-ae70-edd54576bc88",
    "slug": "6903-nw-evans-wd",
    "acf": {
      "slug": "3-bedroom-3-bathroom-6903-nw-evans-wd",
      "title": "3 bedroom 3 bathroom 6903 NW Evans Wd",
      "description": "<p>Welcome to the home you&#8217;ve been waiting for! This beautiful home is sure to impress with modern finishings throughout. The main floor features a large kitchen with clean white cabinetry, stainless steal appliances, walk through panty, and a centre island. Open to the living area, enjoy a beautiful wall mounted electric fire place that creates a cozy atmosphere. The main floor also features a two piece bathroom and a room that may be utilized as an office space to fit your needs. The upper floor master suite features a private five piece bathroom leading through to a walk in closet with organized shelving. In addition, the upper floor has two more bedrooms and a four piece bathroom. The community of Edgemont is a wonderful neighbourhood located near many walking trails, playgrounds, and other amenities. Come take a look for yourself! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1780",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4193765",
      "address": "6903 NW Evans Wd",
      "city": "Edmonton",
      "listedprice": "440000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193765/20200414173653/01.jpeg"
    }
  },
  {
    "id": "fdc8347f-97c8-544b-a2e4-f1117a0f3da4",
    "slug": "5544-nw-19a-ave",
    "acf": {
      "slug": "4-bedroom-2-bathroom-5544-nw-19a-ave",
      "title": "4 bedroom 2 bathroom 5544 NW 19a Ave",
      "description": "<p>Welcome to this 4+1 bedroom townhouse in Aspen Close. This 1184 sq ft well managed complex is located in a quiet area. You will find newer windows bringing in natural light, newer flooring and recently painted. Walk in where you are greeted with vaulted ceilings in dining room &#038; kitchen with new counter tops lots of cupboard space, overlooking a bright, large living room with patio doors leading to a private fenced patio. Main floor features a large master bedroom. Upper level features 2 bedrooms with a nice wide hallway leading to the top level with another good sized bedroom and 4 pc bathroom completely renovated with large soaker tub. Finished basement with family room, bedroom and large laundry/storage area. New Furnace, Adjoining wall has sound deadening insulation and double drywall. Outstanding Value in this beautiful unit. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1185",
      "numbedroom": "4",
      "numbathroom": "2",
      "mlsnumber": "E4193992",
      "address": "5544 NW 19a Ave",
      "city": "Edmonton",
      "listedprice": "204000",
      "propertytype": "Townhouse",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193992/20200414173700/01.jpeg"
    }
  },
  {
    "id": "aeb48cef-982f-5b85-adb8-f7a4b15b34e0",
    "slug": "4538-nw-35a-ave",
    "acf": {
      "slug": "4-bedroom-2-bathroom-4538-nw-35a-ave",
      "title": "4 bedroom 2 bathroom 4538 NW 35a Ave",
      "description": "<p>Welcome to this Fantastic Bi-Level situate in the quiet street with walking distance to school! Main floor you&#8217;ll find Large Living room with Large Window, Stunning Hardwood. Spacious Kitchen with Oak colour Kitchen Cabinets; Counters with Nice Backsplash adjacent to Dining area with newer Ceramic tile floorings. 3 Bedroom all with Bright Windows and Hardwood floorings through out. Master bedroom with Mirror Closet. Full Bathroom with newer Vanity. Basement is finished with Large Family room, Bedroom, 3pc Bathroom, Utility &#038; Laundry room. Sizable Yard is fully landscaped &#038; fenced. Side Parking concrete can fit 3 vehicles. Great location with easy access to Public transportation; School; Shopping Centre &#038; all amenities! Quick possession available. Just move-in &#038; enjoy! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "872",
      "numbedroom": "4",
      "numbathroom": "2",
      "mlsnumber": "E4184366",
      "address": "4538 NW 35a Ave",
      "city": "Edmonton",
      "listedprice": "279900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4184366/20200414173552/01.jpeg"
    }
  },
  {
    "id": "f77ff211-02fe-5bd1-8b3e-f23806c731d0",
    "slug": "2015-nw-blue-jay-co",
    "acf": {
      "slug": "4-bedroom-4-bathroom-2015-nw-blue-jay-co",
      "title": "4 bedroom 4 bathroom 2015 NW Blue Jay Co",
      "description": "<p>BEAUTIFULLY upgraded F/F 2252sf 2 sty built by C2 homes located in Starling with quick access to St. Albert &#038; Edmonton. This home has tons of upgrades &#038; absolutely STUNNING from the inside out!The main flr features 10 ft ceilings w/a bright &#038; spacious open concept layout + a den. The kitchen boasts custom cabinets to the ceiling, ample counter space, a walk-thru pantry &#038; SS appl. The living rm is bright &#038; cozy w/a gas FP &#038; feature wall. The dining area overlooks the oversized yard featuring a 3 tiered deck, fire pit, superb curb edging &#038; professionally landscaped. Entertaining never looked so good! The upper level has a huge bonus room w/a glass wall, laundry rm w/a sink, 3 lrg bedrms &#038; a 4pce bath. The master is fit for a KING&#038;QUEEN w/a walk in closet &#038; a 5pce SPA-like ensuite! The basement features 9ft ceilings, a wet bar, rec rm, gym, bedrm &#038; 4pce bath PLUS plenty of storage! Upgrades incl A/C, insulation, marble/quartz, upgraded flooring, oversized dble garage &#038; much more! This home is a perfect 10! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2253",
      "numbedroom": "4",
      "numbathroom": "4",
      "mlsnumber": "E4193983",
      "address": "2015 NW Blue Jay Co",
      "city": "Edmonton",
      "listedprice": "559900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193983/20200414173657/01.jpeg"
    }
  },
  {
    "id": "3007b1e2-9876-52a8-a743-da57be1b168c",
    "slug": "9535-nw-87-st",
    "acf": {
      "slug": "3-bedroom-1-bathroom-9535-nw-87-st",
      "title": "3 bedroom 1 bathroom 9535 NW 87 St",
      "description": "<p>Great Strathearn location! This beautiful bungalow is over 1600 square feet and sits on a massive 6327sq ft lot. It is sure to impress with its unique style and one of a kind features. As soon as you walk in you enter a gorgeous den area with tons of natural light. The living room is enclosed in brick with a fireplace creating a cozy atmosphere. The kitchen comes with upgraded appliances and is situated right next to the oversized family room perfect for entertaining friends and family. The property comes complete with 3 spacious bedrooms. The community of Strathearn is a wonderful neighborhood located near many walking trails, playgrounds, and other amenities. Come take a look for yourself! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1696",
      "numbedroom": "3",
      "numbathroom": "1",
      "mlsnumber": "E4193937",
      "address": "9535 NW 87 St",
      "city": "Edmonton",
      "listedprice": "419000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193937/20200413193708/01.jpeg"
    }
  },
  {
    "id": "e582c2db-ed0c-5684-9b61-418376a3c109",
    "slug": "106-3353-nw-16a-ave",
    "acf": {
      "slug": "2-bedroom-2-bathroom-106-3353-nw-16a-ave",
      "title": "2 bedroom 2 bathroom 106-3353 NW 16a Ave",
      "description": "<p>FANTASTIC LOCATION&#8230;RECENTLY RENOVATED&#8230;TITLED UNDERGROUND HEATED PARKING&#8230;OPEN CONCEPT&#8230;IN SUITE LAUNDRY AND STORAGE&#8230;This gorgeous main floor 2 bedroom, 2 bathroom condo is located in the beautiful and well run complex of Elements at Laurel Crossing. Meticulously cared for from the inside to the outside, this beautiful property has stainless steel appliances, centre island with double sink, modern dark cabinetry, built in desk or coffee bar and features many upgrades including new dark grey luxury vinyl plank flooring, countertops, paint, plumbing fixtures and backsplash. The large master bedroom has a walk-through closet and 4 piece bathroom. Enjoy the convenience of one underground parking stall, along with visitor parking for your friends and family. This complex is ideally located near schools, shopping, and public transportation. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "811",
      "numbedroom": "2",
      "numbathroom": "2",
      "mlsnumber": "E4193887",
      "address": "106-3353 NW 16a Ave",
      "city": "Edmonton",
      "listedprice": "193702",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193887/20200412123631/01.jpeg"
    }
  },
  {
    "id": "1adce6a1-4314-5769-a95a-2325a3664452",
    "slug": "401-11808-sw-22-ave",
    "acf": {
      "slug": "2-bedroom-2-bathroom-401-11808-sw-22-ave",
      "title": "2 bedroom 2 bathroom 401-11808 SW 22 Ave",
      "description": "<p>Well maintained PENTHOUSE 969 sq ft corner unit could be yours immediate. This 2 bedrooms plus den and 2 full bathrooms has been beautifully upgraded, . As well the spacious unit is air-conditioned and has a patio door leading to a large private balcony with gas hook up and stunning city views. The master bedroom has a walk through closet leading to the three piece ensuite bath with over-sized shower. The upgrade features include stainless steel appliances, wood shaker style cabinets, mosaic back splash, upgraded faucets and lighting fixtures, laminate flooring in the common area and upgraded wall to wall carpet in the bedrooms. The unit also comes with one titled underground parking stall as well as a locked storage area (not commonly found in this complex). Close to all amenities, shopping, public transportation, schools, and major roadways. ALSO HOW ABOUT NO CONDO FEES FOR FOUR MONTHS!!! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "969",
      "numbedroom": "2",
      "numbathroom": "2",
      "mlsnumber": "E4193889",
      "address": "401-11808 SW 22 Ave",
      "city": "Edmonton",
      "listedprice": "194800",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193889/20200412211040/01.jpeg"
    }
  },
  {
    "id": "a81dc928-8fc0-52cd-8f94-ddb6d8806a5b",
    "slug": "2829-nw-terwillegar-wd",
    "acf": {
      "slug": "4-bedroom-3-bathroom-2829-nw-terwillegar-wd",
      "title": "4 bedroom 3 bathroom 2829 NW Terwillegar Wd",
      "description": "<p>Simply stunning! 2657 sf of luxury located in desireable Terwillegar Gardens on a quiet cul-de-sac. 2sty, 4bed, 2.5bath open concept home defines excellent craftsmanship, class &#038; elegance. Prof landscaped large yard surrounded by mature trees w/patio, shed, garden, irrigation syst, composite deck + newer ground deck perf for friends/family gatherings. Newly refinished hardwood, new quartz/granite counters, vaulted foyer ceilings, iron railings &#038; lots of natural light thruout w/lots of windows. Main floor showcases exec den &#038; formal dining, spacious kitchen w/an O/S island, SS appliances+gas range, pantry &#038; eating area. Cozy great rm w/gas FP perf on a cold winter day. Upper boasts 4 bed + sep huge vaulted bonus w/builtin media unit, Huge master has W/I, spa-like 5pc ensuite w/shower+jetted soaker. Laundry w/sink on main level. Bsmt ready for your personal touch. Long driveway &#038; dbl att&#8217;d garage suitable for growing family. Mins to schools, Rec Centre, parks/ponds, shopping. Incredible value! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2658",
      "numbedroom": "4",
      "numbathroom": "3",
      "mlsnumber": "E4193843",
      "address": "2829 NW Terwillegar Wd",
      "city": "Edmonton",
      "listedprice": "688800",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193843/20200411013638/01.jpeg"
    }
  },
  {
    "id": "3e5b4b61-c377-56ee-a982-1c17c4fe40c2",
    "slug": "213-14-rge-rd",
    "acf": {
      "slug": "4-bedroom-3-bathroom-213-14-rge-rd",
      "title": "4 bedroom 3 bathroom 213-14 Rge Rd",
      "description": "<p>Exceptionally well maintained 5 level split, with great curb appeal, is sure to impress and checks off all of the I WANTS for the whole family. Spacious, with almost 1800 square feet above grade, the main floor features a large kitchen that has been opened up to the dining and living room area. The upper floor features huge master suite with 3 pe ensuite and large walk in closet, an additional 2 good sized bedrooms and a 4 pce bath to share. The lower third level features a large family room with cozy fireplace, large laundry room and 2 pce bath. The basement is 2 levels with a large living space, spacious bedroom, and the lowest level is currently being used as a gym. The outside features a TRIPLE attached garage, as well as a double detached garage. The property is fenced for horses, features a paved driveway and a newer roof. Located in an excellent subdivision close to the wilderness centre and blackfoot reserve and trails, and just 10 minutes from Sherwood Park and even less time to Ardrossan! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1761",
      "numbedroom": "4",
      "numbathroom": "3",
      "mlsnumber": "E4193800",
      "address": "213-14 Rge Rd",
      "city": "Edmonton",
      "listedprice": "582500",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193800/20200410174111/01.jpeg"
    }
  },
  {
    "id": "6ccee00d-6b10-54ee-b4c7-9dd67c5aadb0",
    "slug": "6811-nw-136-ave",
    "acf": {
      "slug": "5-bedroom-2-bathroom-6811-nw-136-ave",
      "title": "5 bedroom 2 bathroom 6811 NW 136 Ave",
      "description": "<p>Mint Condition!!! This 5 bedroom dream home is ready for a new family who wants to enjoy a high grade quality interior and relaxing in a large beautified backyard. A few features of this prime located bungalow feature a bright renovated white kitchen with a breakfast island and stainless steel appliances, exquisite reclaimed flooring, triple pane durabuilt windows, air-conditioning, master with private ensuite, a fully finished basement with ample space for an office, 2 bedrooms and a second family room, RV parking and an oversized (28 x 24) garage with welding plug and is rough in for in-floor heating. Located within walking distance to elementary schools, parks and amenities, this is prime real estate in the heart of Delwood! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1059",
      "numbedroom": "5",
      "numbathroom": "2",
      "mlsnumber": "E4193792",
      "address": "6811 NW 136 Ave",
      "city": "Edmonton",
      "listedprice": "365000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193792/20200410173637/01.jpeg"
    }
  },
  {
    "id": "8a387cc7-b862-503e-a80a-e5b70e0ef2b2",
    "slug": "2579-nw-pegasus-bv",
    "acf": {
      "slug": "3-bedroom-3-bathroom-2579-nw-pegasus-bv",
      "title": "3 bedroom 3 bathroom 2579 NW Pegasus Bv",
      "description": "<p>Welcome to this one of a kind Pacesetter built 2314 sq. ft. 2 storey with double detached garage in the beautiful neighborhood of GRIESBACH . Upon entering feel welcomed into the living room which features 9&#8242; high ceilings, hand scraped hardwood, a stone tiled wall, and double sided fireplace with custom floating mantel from Urban Timber. Adjacent to the living room is a lifestyle room with plenty of bookshelves. Enter into the kitchen and the chef in you will be in heaven. The kitchen features full height cabinets with crown molding, pot drawers and granite counter tops, walk in pantry, large island, gas stove, stainless steel appliances and plenty of windows. Enjoy family dinners in the large nook area then relax on the private deck with a gas burning fireplace. Upstairs the master bedroom has vaulted ceilings, a walk in closet and ensuite with large soaker tub and separate shower. The upstairs is completed with two more bedrooms, full bathroom and laundry room. This house is move in ready! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2315",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4193782",
      "address": "2579 NW Pegasus Bv",
      "city": "Edmonton",
      "listedprice": "599900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193782/20200410055034/01.jpeg"
    }
  },
  {
    "id": "a0d0e634-34db-5a31-aaf3-b43ea1d078b3",
    "slug": "8707-nw-52-st",
    "acf": {
      "slug": "3-bedroom-1-bathroom-8707-nw-52-st",
      "title": "3 bedroom 1 bathroom 8707 NW 52 St",
      "description": "<p>Fantastic opportunity with this bungalow situated on a quiet street in Kenilworth! This home has been well-kept and has a great floor plan with a bright and open living and dining room with original hardwood floors. The kitchen has everything you need plus a view of your back yard. Down the hall there are 2 bedrooms and could be converted back to 3 bedrooms. The fully finished lower level has an additional bedroom, huge recreation room and large laundry room with ample storage. The back yard is fenced and offers plenty of space for the double detached garage, patio area, lovely mature trees and even a great area for a vegetable garden! Kenilworth is a beautiful community with multiple schools and parks, easy access to public transportation plus you are within minutes to Downtown, the University of Alberta and near shopping and groceries stores. A must see! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1065",
      "numbedroom": "3",
      "numbathroom": "1",
      "mlsnumber": "E4193638",
      "address": "8707 NW 52 St",
      "city": "Edmonton",
      "listedprice": "339900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193638/20200408214733/01.jpeg"
    }
  },
  {
    "id": "8266dbe1-0d70-5a0e-b9bd-73b7c25c1823",
    "slug": "18038-nw-96-ave",
    "acf": {
      "slug": "3-bedroom-2-bathroom-18038-nw-96-ave",
      "title": "3 bedroom 2 bathroom 18038 NW 96 Ave",
      "description": "<p>Awesome opportunity to add sweat equity to this 3 bedroom townhome with carport and large yard! Appliances as is where is. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1090",
      "numbedroom": "3",
      "numbathroom": "2",
      "mlsnumber": "E4193629",
      "address": "18038 NW 96 Ave",
      "city": "Edmonton",
      "listedprice": "178000",
      "propertytype": "Townhouse",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193629/20200410020047/01.jpeg"
    }
  },
  {
    "id": "5840ad00-28e4-517e-bdc4-ce048adf7e79",
    "slug": "180-sw-callaghan-dr",
    "acf": {
      "slug": "5-bedroom-4-bathroom-180-sw-callaghan-dr",
      "title": "5 bedroom 4 bathroom 180 SW Callaghan Dr",
      "description": "<p>Welcome home to your F/FIN home backing onto a pond/green space. This CUSTOM built home is the best of both worlds, ideal for for your growing family &#038; GORGEOUS space to entertain! You are greeted w/open to above foyer &#038; formal dining surrounded w/windows. The kitchen is a Chef&#8217;s dream w/tons of cabinetry, ample amount of counter space, a corner pantry &#038; S/S appliances. The dining/living area boast tons of natural light &#038; breath-taking views of the pond! Your sunny nook leads you to your maintenance free deck/yard to enjoy summer BBQ&#8217;s w/the family &#038; take in the scenery around you! A den, 2pce bath &#038; laundry complete the main floor. The upper level features an oversized bonus rm w/huge windows. The master is fit for a KING/QUEEN w/5 piece spa like ensuite with his &#038; her sinks &#038; a walk in closet. Addl 2 bedrooms and a 4 pce bath on this level. The basement is perfect to unwind with your very own sauna &#038; theatre room w/wet bar. Another 2 berms and a 4pce bathroom. A MUST see! This home has it ALL! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2764",
      "numbedroom": "5",
      "numbathroom": "4",
      "mlsnumber": "E4193594",
      "address": "180 SW Callaghan Dr",
      "city": "Edmonton",
      "listedprice": "719000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193594/20200409195111/01.jpeg"
    }
  },
  {
    "id": "2c307181-5553-5b77-be0e-a0cce7de9212",
    "slug": "3002-10360-nw-102-st",
    "acf": {
      "slug": "1-bedroom-1-bathroom-3002-10360-nw-102-st",
      "title": "1 bedroom 1 bathroom 3002-10360 NW 102 St",
      "description": "<p>The Legends Private Residences located in the exciting &#038; celebrated Ice District is going to WOW any buyer looking for a luxurious lifestyle, Unparalleled Amenities &#038; Sophisticated suites that are both stylish &#038; modern featuring 1 bedroom, 4pc bath, DEN, European kitchen &#038; GORGEOUS VIEW. This PET FRIENDLY complex offers every LUXURY from direct indoor access to Rogers Place, VIP access to concerts PLUS direct connection to Edmonton&#8217;s raised Pedway system, LRT &#038; major office buildings throughout the downtown core. STEPS away from boutique shopping, excellent dining, entertainment &#038; ICE District Public Plaza with year round events. Exclusive inspired social &#038; amenity spaces including a Boardroom, Party lounge with Innovative retractable glass walls to open up to the patio with SPECTACULAR VIEWS, Fire Pits, Bar &#038; BBQ dining area PLUS a central GREEN SPACE! Residents can access a variety of la carte luxury Hotel &#038; Concierge services including a STUNNING pool, gym &#038; spa PLUS underground HEATED &#038; SECURE parking (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "589",
      "numbedroom": "1",
      "numbathroom": "1",
      "mlsnumber": "E4193449",
      "address": "3002-10360 NW 102 St",
      "city": "Edmonton",
      "listedprice": "399900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193449/20200408164123/01.jpeg"
    }
  },
  {
    "id": "b7653e86-dfe4-5f8b-bc71-76c384c6b0ad",
    "slug": "5811-nw-109-st",
    "acf": {
      "slug": "6-bedroom-6-bathroom-5811-nw-109-st",
      "title": "6 bedroom 6 bathroom 5811 NW 109 St",
      "description": "<p>Welcome to this stunning 2628 sq ft home! Perfect for a large family or for anyone that loves to entertain. When you enter the home, you are greeted by a 17 ft open to above foyer thats sure to leave a good first impression. The main floor offers a large mudroom, living room, dining room and chefs style kitchen with a full-size fridge/freezer and walk through pantry. On the second floor youll find dual master bedrooms with large walk in closets and ensuites, two additional bedrooms sharing a Jack and Jill ensuite and a laundry room. The third floor is the entertainment hub of this home featuring a guest washroom, wet bar and bonus room that spills onto a roof top patio the size of the entire roof. All of this plus a double garage, completely finished landscaping and a finished basement with 2 additional bedrooms, an additional living room and bathroom. Dont miss out on this rare style home in the beautiful neighbourhood of Pleasantview. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2629",
      "numbedroom": "6",
      "numbathroom": "6",
      "mlsnumber": "E4193580",
      "address": "5811 NW 109 St",
      "city": "Edmonton",
      "listedprice": "1050000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193580/20200408173705/01.jpeg"
    }
  },
  {
    "id": "093e432c-cc32-5ce9-8611-f7ca0d288e87",
    "slug": "130-4404-nw-122-st",
    "acf": {
      "slug": "2-bedroom-2-bathroom-130-4404-nw-122-st",
      "title": "2 bedroom 2 bathroom 130-4404 NW 122 St",
      "description": "<p>Welcome to Aspen Garden Estates! This recently renovated 2 bed + den unit is one of the most desirable in the complex. Perfect for a small family, investment property, downsizing, or U of A students. Over 1100 sqft, open living area, great dining space, nice kitchen, huge master bedroom, spacious 2nd bedroom and den, 1.5 baths, in-suite laundry, and 1 parking stall (2nd is available). Easy access to/from the parking stall through the gorgeous patio area. Recent improvements include: flooring, paint, s.s. appliances, counters, backsplash, and more. Very well managed complex that just completed a major interior/exterior/plumbing renovation. The complex features such amenities as a swimming pool/hot tub, exercise room, and rec centre. All utilities included in the condo fees. Unbeatable location steps from ravine trails, and close to the U of A, Whitemud Fwy, Downtown, LRt station, Derrick Club and more. Hard to find this type of value at such an affordable price. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1104",
      "numbedroom": "2",
      "numbathroom": "2",
      "mlsnumber": "E4193553",
      "address": "130-4404 NW 122 St",
      "city": "Edmonton",
      "listedprice": "154900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193553/20200408053638/01.jpeg"
    }
  },
  {
    "id": "9f0fbed4-7251-5a86-a949-86f728d2d17b",
    "slug": "104-nw-saskatchewan-dr",
    "acf": {
      "slug": "6-bedroom-7-bathroom-104-nw-saskatchewan-dr",
      "title": "6 bedroom 7 bathroom 104 NW Saskatchewan Dr",
      "description": "<p>Stunning home with a recently renovated living room to create a more open concept! We love the beautiful trails out our front door enjoying fresh air year round! We love conversations in our Gazebo or enjoying a quiet coffee. Love holidays with family &#038; friends watching sports in our media room drinks, snacks &#038; fresh popcorn! Our 6 kids had a stellar education with close access to LRT, bike or walk to the UofA. Love that we are mins from Downtown &#038; great restaurants. Love never having cold feet w in-flr heating. Love our cooking gatherings in a kit revered by any chef. Love memories playing pool in the game room with our kids. Love our front deck &#038; our 2 cherry trees in bloom. Love making cherry jam each fall. Love our lilacs in bloom walking up the front steps. Love the compliments on our maintenance free landscaping. Love unloading the car in our over-sized garage. Love the hot/cold water to clean vehicles year round. Love our welcoming neighborhood with dear friends we will miss (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "3240",
      "numbedroom": "6",
      "numbathroom": "7",
      "mlsnumber": "E4193511",
      "address": "104 NW Saskatchewan Dr",
      "city": "Edmonton",
      "listedprice": "1350000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193511/20200407214053/01.jpeg"
    }
  },
  {
    "id": "978c6808-4996-5921-95bd-fc3bec65b44a",
    "slug": "2713-10360-nw-102-st",
    "acf": {
      "slug": "1-bedroom-1-bathroom-2713-10360-nw-102-st",
      "title": "1 bedroom 1 bathroom 2713-10360 NW 102 St",
      "description": "<p>The Legends Private Residences located in the exciting &#038; celebrated Ice District is going to WOW any buyer looking for a luxurious Urban lifestyle, Unparalleled Amenities &#038; Architecturally Sophisticated suites that are both stylish &#038; modern featuring 1 bedroom, 4pc bath, European kitchen &#038; GORGEOUS VIEW. This executive complex offers every LUXURY from direct indoor access to Rogers Place, VIP access to concerts PLUS direct connection to Edmonton&#8217;s raised Pedway system, LRT &#038; major office buildings throughout the downtown core. You are also just a stroll away from boutique shopping, excellent dining, entertainment &#038; ICE District Public Plaza with year round events. Exclusive inspired social &#038; amenity spaces including a Boardroom, Party lounge with Innovative retractable glass walls to open up to the patio with SPECTACULAR VIEWS, Fire Pits, Bar &#038; BBQ dining area PLUS a central GREEN SPACE!!! Residents can access a variety of la carte luxury Hotel &#038; Concierge services including a STUNNING pool, gym &#038; spa! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "616",
      "numbedroom": "1",
      "numbathroom": "1",
      "mlsnumber": "E4193447",
      "address": "2713-10360 NW 102 St",
      "city": "Edmonton",
      "listedprice": "399900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193447/20200408163224/01.jpeg"
    }
  },
  {
    "id": "b15b98d2-2b04-597d-a89a-ef9963ffcb4b",
    "slug": "11442-nw-123-st",
    "acf": {
      "slug": "3-bedroom-3-bathroom-11442-nw-123-st",
      "title": "3 bedroom 3 bathroom 11442 NW 123 St",
      "description": "<p>Executive 2 storey, 3 bedroom, 2.5 bath, over 1700 sqft., 9 ft. ceilings throughout including double garage, large yard and deck! Including a separate entrance to basement for possible legal suite. Steps to the Arts and Entertainment district on 124 st &#038; off lease area with a walking/biking trail to the Brewery &#038; City Market and all the way to the UofA ! Master bedroom features a roof top terrace, ensuite bath &#038; walkin closet. Open concept kitchen with Stainless Steel appliances, Granite and Quartz counter tops, a large eating bar, LED lighting throughout. The family room is entirely open to the kitchen and dining room area and flooded with natural light from the main floor windows. Upstairs there are 3 bedrooms, bath, washer/dryer. Situated in the heart of Inglewood with tree lined streets, turn of the century character homes and the best of cutting edge infill homes. Ask about our Options for fully Custom finished basements or legal suite with Occupancy Certificate. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1725",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4193533",
      "address": "11442 NW 123 St",
      "city": "Edmonton",
      "listedprice": "559000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193533/20200407233734/01.jpeg"
    }
  },
  {
    "id": "0d9d5877-b69b-599f-9b50-8f802a12e449",
    "slug": "235-10309-nw-107-st",
    "acf": {
      "slug": "1-bedroom-1-bathroom-235-10309-nw-107-st",
      "title": "1 bedroom 1 bathroom 235-10309 NW 107 St",
      "description": "<p>LOFT LIVING! 1492 square foot 1 bedroom with 1 full bathroom downtown second floor loft in the Seventh Street Lofts! Spacious entrance with polished concrete floors throughout! Open concept kitchen with large Island and plenty of cabinets. Huge windows and stunning brick feature wall. Bedroom area has built in closets and you have your own insuite laundry! Literally steps from Grant Macewan and Roger&#8217;s place with several restaurants and shops within walking distance. Small pets allowed. condo fees are $780 which include heat and water. Comes with 1 heated underground parking stall separately titled (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1486",
      "numbedroom": "1",
      "numbathroom": "1",
      "mlsnumber": "E4193499",
      "address": "235-10309 NW 107 St",
      "city": "Edmonton",
      "listedprice": "395000",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193499/20200407194139/01.jpeg"
    }
  },
  {
    "id": "83c97dc5-6481-5943-b5ff-f1af829dd8b7",
    "slug": "9032-nw-52-st",
    "acf": {
      "slug": "4-bedroom-2-bathroom-9032-nw-52-st",
      "title": "4 bedroom 2 bathroom 9032 NW 52 St",
      "description": "<p>Cozy. Classic. Cool. Top to Bottom you will fall in love with this Fully Finished 4 bedroom/2 Full Bath bungalow PLUS a downstairs DEN/FLEX room. Professionally renovated with more than 2100 SF of living space, this house exudes warmth and is flooded in natural light. Caramel Acacia hardwood flooring throughout the main level. Open kitchen features beautiful granite and newer windows overlooking your large backyard with patio and O/S Double Garage. All done. Newer High Efficiency Furnace, HTW, plumbing, electrical, lighting stunning barn board feature wall, media walls with built-in shelving in the LR and lower Rumpus room. Plush cushy carpet in the lower level and TWO STUNNING SPA BATHS &#8211; one up and one down. Walk to school, drive to work downtown or southside in minutes, love your hood. Ottewell is an amazing community! Phenomenal schools &#8211; all three levels. Local coffee shop offers live music and delicious treats! So many events offered through the community league! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1145",
      "numbedroom": "4",
      "numbathroom": "2",
      "mlsnumber": "E4193476",
      "address": "9032 NW 52 St",
      "city": "Edmonton",
      "listedprice": "524000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193476/20200407174051/01.jpeg"
    }
  },
  {
    "id": "bb798242-afc0-5380-85fa-968c5909e99d",
    "slug": "5966-nw-edmonds-cr",
    "acf": {
      "slug": "3-bedroom-3-bathroom-5966-nw-edmonds-cr",
      "title": "3 bedroom 3 bathroom 5966 NW Edmonds Cr",
      "description": "<p>SURROUNDED BY NATURE this beautifully designed 2-story overlooks the Environmental Reserve in Edgemont. Welcoming you w/ stunning hardwood, modern lighting &#038; striking details from WAINSCOTING to PLANTATION SHUTTERS. TONS OF NATURAL LIGHT flows in the MANY LARGE WINDOWS w/ a view of the park. Stylish u-shaped kitchen w/ a gas-cooktop, ELEVATED WHITE CABINETS w/ soft closers, center quartz island &#038; walk-through pantry. Open floorplan showcases a stone-faced fireplace, sizable dining area with access to a REMARKABLE YARD. Den, 2 pce bath &#038; mudroom complete the main. Upstairs are 2 GENEROUS beds, expansive bonus rm &#038; MASTER SUITE. Master includes an UPSCALE ENSUITE w/ dual shower heads, dual vanity, soaker tub, WIC w/makeup area. Upper floor laundry has direct access to the master for your convenience. Artfully designed, this yard is where you will be spending your summer days w/ a 3-TIERED COMPOSITE DECK, PRIVACY SCREEN, hot tub, DUAL-GAS LINE for BBQ &#038; FIREPIT, &#038; under deck storage. Make this you new home! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2767",
      "numbedroom": "3",
      "numbathroom": "3",
      "mlsnumber": "E4184993",
      "address": "5966 NW Edmonds Cr",
      "city": "Edmonton",
      "listedprice": "689900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4184993/20200407173555/01.jpeg"
    }
  },
  {
    "id": "0d0faecc-debd-5f2d-b720-286dc9a08eb8",
    "slug": "114-2741-nw-55-st",
    "acf": {
      "slug": "1-bedroom-1-bathroom-114-2741-nw-55-st",
      "title": "1 bedroom 1 bathroom 114-2741 NW 55 St",
      "description": "<p>Clean and Functional 1 bedroom condo in the Place at Lakeside. This floor plan is larger than usual, offering great space throughout! Large open oak kitchen has plenty of cupboard and counter space, and the large master bedroom features a walk in closet with built in organizers. This unit features in suite laundry/storage, no carpet, and the 4 piece bathroom has been modified to accommodate a wheelchair with reinforced grab bars added as well. Don&#8217;t feel like cooking everyday? This building has direct indoor pedway access to the Allen Grey Centre and the restaurant there. The heated underground parking has a storage area, and features a wash bay. The building boasts an exercise room, games room, movie room, library, billiards and shuffleboard as well as a banquet hall. The building&#8217;s large south facing deck overlooks the lake and walking trails. Within walking distance to shops and restaurants. Transit stops right outside the door, and the Grey Nuns hospital and medical clinics across the street. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "711",
      "numbedroom": "1",
      "numbathroom": "1",
      "mlsnumber": "E4193691",
      "address": "114-2741 NW 55 St",
      "city": "Edmonton",
      "listedprice": "129900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193691/20200409173700/01.jpeg"
    }
  },
  {
    "id": "244676e5-e6ba-5d5b-b80c-3333b9bbd3cb",
    "slug": "5747-sw-keeping-cr",
    "acf": {
      "slug": "3-bedroom-4-bathroom-5747-sw-keeping-cr",
      "title": "3 bedroom 4 bathroom 5747 SW Keeping Cr",
      "description": "<p>BRAND NEW STUNNING WALKOUT 2 sty exudes quality &#038; luxury. 2743 sf contemporary home w/an open concept plan, perfect for entertaining. Nestled on a quiet street in prestigious Keswick backing to a gorgeous pond. Chefs kitchen will please the most discerning foodie- an abundance of sleek modern cabinetry, upgraded quartz counters, a huge island, high end stainless steel appliances incl a 36 gas top range &#038; a huge walkthrough butlers pantry. The sunlit cheery home boasts a wall of floor to ceiling windows in the vaulted Great rm &#038; a feature tiled wall for the linear gas FP. Main flr den/bedrm w/full bath. 3 bedrms upstairs, each w/their own ensuites incl a luxurious MBR w/spa like ensuite &#038; massive W/I closet. Upper level laundry rm bonus rm. Stunning contemporary light fixtures, 8 ft drs, 9 ft ceilings on ALL three levels, glass railing &#038; wide plank engineered hardwood &#038; lots of ceiling details are but a few features of this home. 2 balconies overlooking the pond/trails. Acrylic stucco, 24&#215;23 dbl garage (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2744",
      "numbedroom": "3",
      "numbathroom": "4",
      "mlsnumber": "E4193671",
      "address": "5747 SW Keeping Cr",
      "city": "Edmonton",
      "listedprice": "788800",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193671/20200409033718/01.jpeg"
    }
  },
  {
    "id": "2557b127-fe78-5fb1-9d30-267dc849b783",
    "slug": "956-nw-hollingsworth-bn",
    "acf": {
      "slug": "4-bedroom-4-bathroom-956-nw-hollingsworth-bn",
      "title": "4 bedroom 4 bathroom 956 NW Hollingsworth Bn",
      "description": "<p>BEST VALUE! Gorgeous 3+1 bedroom CUSTOM built bungalow w/an over sized TRIPLE garage. Stunning stone &#038; a new entryway graces the exterior of this home nestled on prestigious Hollingsworth Bend, mature treed street lined w/$million homes &#038; just steps to the PARK/ RAVINE/ Natural Pond. Boasting soaring ceilings, loads of natural light, feature walls &#038; a breathtaking stone wall w/a beautiful Old World fireplace. The spacious open plan w/an elegant living/dining room. Perfect for those who love to entertain. Huge 2nd master suite w/ensuite &#038; balcony- can be used as a bonus rm, nanny suite, exercise rm or a studio. Beautiful Master bedrm w/a spa like ensuite &#038; a huge W/I. 3rd bedrm/ den &#038; laundry on the MAIN level. Gleaming hardwood flooring, &#038; marble floors, iron rails, ceiling detailing, oak doors, granite counters &#038; a huge CHEFs kitchen w/a huge island. F/Fin bsmt w/ media rm/den, 4th bedrm, summer kitchen, huge rec rm &#038; in floor heating. 4 full baths + A/C. SW private yard. A TEN! Close to all amenities (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2496",
      "numbedroom": "4",
      "numbathroom": "4",
      "mlsnumber": "E4193673",
      "address": "956 NW Hollingsworth Bn",
      "city": "Edmonton",
      "listedprice": "798800",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193673/20200409033720/01.jpeg"
    }
  },
  {
    "id": "75295cee-afd8-572a-aa6b-524afe93039e",
    "slug": "3111-nw-42-ave",
    "acf": {
      "slug": "4-bedroom-3-bathroom-3111-nw-42-ave",
      "title": "4 bedroom 3 bathroom 3111 NW 42 Ave",
      "description": "<p>GREAT PRICE, UPGRADED, SHOWS WELL! Well-kept Jayman built home in quiet crescent. South yard lots of sunshine all day long in the kitchen and large main floor family room. Delightful open plan. 4 bedrooms including main floor bedroom/den. Upgrades include new or newer: LUXURY STAINLESS STEEL APPLIANCES (including gas stove), carpet, paint, light fixtures, GRANITE COUNTERS, window coverings, faucets, toilets, pressure treated deck, shingles, etc. Main floor laundry, all big bedrooms upstairs. Partly finished basement has huge family room. Mature trees. All furniture negotiable including very expensive dining set. Excellent neighborhood includes public elementary school and brand new junior high school (opening September, 2020). One of the best priced homes in south Edmonton, over 2,100 square feet built after 1990. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "2111",
      "numbedroom": "4",
      "numbathroom": "3",
      "mlsnumber": "E4193649",
      "address": "3111 NW 42 Ave",
      "city": "Edmonton",
      "listedprice": "428500",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193649/20200408233714/01.jpeg"
    }
  },
  {
    "id": "d14999c7-409d-5af8-ab71-aec9f1c8fde6",
    "slug": "13338-nw-110-ave",
    "acf": {
      "slug": "6-bedroom-5-bathroom-13338-nw-110-ave",
      "title": "6 bedroom 5 bathroom 13338 NW 110 Ave",
      "description": "<p>Timber Haus Developments New Creation: Incredible Infill Featuring LEGAL 2 Bedroom BASEMENT SUITE with 9FT Ceilings AND A 1 Bedroom Garden Suite! &#8211; Attention to Detail and Design at Every Corner &#8211; this Glamorous Infill Offers Character and Charm &#8211; 2&#215;6 Construction &#8211; From the Oversized High End Kitchen &#8211; This Home is an EXPERIENCE! Spacious Main Level &#8211; Dining Room &#8211; TOP Quality Quartz Kitchen with TONS of Cabinet and Countertop Space &#8211; Upper Level with King Sized Master Suite with HUGE Ensuite with Dual Vanity &#8211; Walk-In Shower &#8211; Large Walk-In Closet! Two Generous Other Bedrooms &#8211; and Family Bathroom. UPPER LEVEL LAUNDRY &#8211; Exterior will be Fully Fenced and Landscaped &#8211; Double Detached Garage (19&#215;22). You will Not Be Disappointed! Located in a Fantastic Central Neighbourhood with Parks, Schools, Shopping &#8211; and Great Access Downtown! Make it Yours! Possession Date Scheduled: MAY 28th/2020. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1840",
      "numbedroom": "6",
      "numbathroom": "5",
      "mlsnumber": "E4193281",
      "address": "13338 NW 110 Ave",
      "city": "Edmonton",
      "listedprice": "865000",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193281/20200408233702/01.jpeg"
    }
  },
  {
    "id": "603fa9a2-c642-5345-9e7c-a95a50c75767",
    "slug": "3109-nw-139-ave",
    "acf": {
      "slug": "3-bedroom-2-bathroom-3109-nw-139-ave",
      "title": "3 bedroom 2 bathroom 3109 NW 139 Ave",
      "description": "<p>Ready to Move in, Nice Townhouse in a great community, close to schools. This 3 Bedroom, 2 Bathroom Property Features: Nice Living Room with Cozy Fireplace, Finished Basement, Nice &#038; Clean, Huge Backyard that backs onto an Alley. Central Vacuum System &#038; Storage Shed Included. Priced to sell. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1019",
      "numbedroom": "3",
      "numbathroom": "2",
      "mlsnumber": "E4193425",
      "address": "3109 NW 139 Ave",
      "city": "Edmonton",
      "listedprice": "158900",
      "propertytype": "Townhouse",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193425/20200406213743/01.jpeg"
    }
  },
  {
    "id": "100989cd-e9da-5372-a27f-d2a0ffab3aee",
    "slug": "125-2741-nw-55-st",
    "acf": {
      "slug": "2-bedroom-2-bathroom-125-2741-nw-55-st",
      "title": "2 bedroom 2 bathroom 125-2741 NW 55 St",
      "description": "<p>If you are 55+ and you like to socialize, there are plenty of opportunities here; games room, social room, media room, library &#038; billiards. Plus there&#8217;s a beautiful courtyard to enjoy those summer days! Walking paths that lead to transit, coffee, restaurants &#038; shopping. This unit is move in ready with no stairs &#038; it&#8217;s connected to the Allen Gray Continuing Care Centre. Enjoy their Cafeteria when you don&#8217;t feel like cooking! This lovely END UNIT is immaculate and has just been painted throughout in neutral tones &#038; features a beautiful view of the rock garden from the very private balcony. There&#8217;s an open concept kitchen with large eating area &#038; living room, large master suite with walk in closet and 3 pce ensuite. Second bedroom, perfect spare or office, 4 pce main bath and large laundry and storage room completes this unit. Enjoy your morning coffee on the private balcony! Underground heated parking, car wash &#038; charging station for electric scooters completes this package! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "960",
      "numbedroom": "2",
      "numbathroom": "2",
      "mlsnumber": "E4193436",
      "address": "125-2741 NW 55 St",
      "city": "Edmonton",
      "listedprice": "184900",
      "propertytype": "Apartment",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193436/20200406233710/01.jpeg"
    }
  },
  {
    "id": "1e5dd884-aaf7-5339-bbea-e59ea6ad2863",
    "slug": "10107-nw-171a-ave",
    "acf": {
      "slug": "3-bedroom-2-bathroom-10107-nw-171a-ave",
      "title": "3 bedroom 2 bathroom 10107 NW 171a Ave",
      "description": "<p>MOVE IN READY! This lovely bungalow in Baturyn is situated on a corner lot in a quiet cul-de-sac. It offers a great layout with a spacious living room and laminate flooring. Bright &#038; cheery eat-in kitchen with laminate flooring, movable island and all appliances including a new fridge. There are 3 bedrooms on the main plus a 4 piece bathroom. Basement with family room, den, 3 piece bathroom, storage and laundry room. OVERSIZED DOUBLE GARAGE HEATED and 220 wiring as well. Shingles and some windows were replaced in the past. Lovely, fully fenced and huge backyard for your whole family to enjoy! Great curb appeal location close to schools, parks transit and shopping. IMMEDIATE POSSESSION is available! Visit REALTOR website for additional information. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "991",
      "numbedroom": "3",
      "numbathroom": "2",
      "mlsnumber": "E4193433",
      "address": "10107 NW 171a Ave",
      "city": "Edmonton",
      "listedprice": "299707",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193433/20200406225102/01.jpeg"
    }
  },
  {
    "id": "8c2e415f-dcb1-510b-8920-e53f187426cf",
    "slug": "10005-nw-88-ave",
    "acf": {
      "slug": "4-bedroom-2-bathroom-10005-nw-88-ave",
      "title": "4 bedroom 2 bathroom 10005 NW 88 Ave",
      "description": "<p>Absolutely stunning home in the heart of Strathcona! Great curb appeal &#038; a front covered deck welcomes you to this 2 storey home with so much character. You will be proud to greet guests in your huge foyer that leads to the liv rm with gas fireplace. Enjoy a family meal in the spacious din rm. The renovated custom kit is where you will want to spend the most of your time with a large pantry, ceiling height cabinets with pull-outs, SS appliances &#038; a glass backsplash that adds a touch of elegance! Hardwood fls continue to the 2nd lvl with 2 bdrms, den &#038; bath. The lower lvl offers even more living space with a rec rm, bdrm &#038; bath. Many updates such as custom built-ins, electrical, plumbing, insulation, hot water on demand, shingles &#038; more. Home was put on new foundation in 1997. South backyard is fully fenced. Just move in &#038; enjoy. You will fall in love with the lifestyle in this community. Situated on a tree lined street, walking distance to the farmers market, River Valley trails, shopping &#038; restaurants. (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1523",
      "numbedroom": "4",
      "numbathroom": "2",
      "mlsnumber": "E4193761",
      "address": "10005 NW 88 Ave",
      "city": "Edmonton",
      "listedprice": "739900",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193761/20200410001054/01.jpeg"
    }
  },
  {
    "id": "4b7ebead-d723-5a00-902e-149f03a81d69",
    "slug": "4315-nw-37a-ave",
    "acf": {
      "slug": "4-bedroom-3-bathroom-4315-nw-37a-ave",
      "title": "4 bedroom 3 bathroom 4315 NW 37a Ave",
      "description": "<p>2000 SQFT BUNGALOW WITH OVERSIZED TRIPLE ATTACHED GARAGE, .3 ACRE LOT AND SIDING MILL CREEK RAVINE! This is a truly unique custom and quality built bungalow that is one of a kind. The main floor offers 2 beds, formal and informal living rooms, dining areas (one could easily be turned into a den) and a bright kitchen. The open concept is sure to please, making entertaining friends and family a breeze. The master bedroom is very spacious and features a distinctive layout but has plenty of room to redesign if one wants too. Moving to the heart of this home, you will love the kitchen with built in s.s. appliances, loads of cabinetry and counter space. The basement is fully finished with 2 more beds, rec room, craft room and a wet bar. But lets face it, you&#8217;re buying this home for its awesome 3 (maybe 4) car garage that has a third overhead door that accesses the backyard, .3 acre massive lot that sides the ravine and the endless possibilities that over 3500 sqft of living space brings! (id:32586)</p>\n",
      "floorsizeunit": "sq ft",
      "floorsizevalue": "1989",
      "numbedroom": "4",
      "numbathroom": "3",
      "mlsnumber": "E4193704",
      "address": "4315 NW 37a Ave",
      "city": "Edmonton",
      "listedprice": "578500",
      "propertytype": "Single Family Dwelling",
      "mainimage": "https://assets-listings.rew.ca/crea_ddf/ereb/E4193704/20200409174145/01.jpeg"
    }
  }
]
